oneWayCoupledVdfTransportFoam/sizeTaylorGreen/system/momentGenerationDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      momentGenerationDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

phases
(
    particles
);

boundaries
{
    top
    {
        type cyclic;
    }
    bottom
    {
        type cyclic;
    }
    left
    {
        type cyclic;
    }
    right
    {
        type cyclic;
    }
    front
    {
        type empty;
    }
    back
    {
        type empty;
    }
}

particles
{
    type                weightsAndAbscissae;
    weightDimension     [0 0 0 0 0 0 0];
    abscissaDimension0  [0 1 0 0 0 0 0];
    abscissaDimension   [0 1 -1 0 0 0 0];

    default
    {
    }

    regions
    (
        cylinderToCell
        {
            p1 (0 0.05 -0.5);
            p2 (0 0.05 0.5);
            radius 0.05;

            node0
            {
                weight  uniform 0.1;
                abscissae (0.00025 0 0);
            }
        }
    );
}


// ************************************************************************* //
